app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE (category in('Arts','Education','Entertainment','Others','Outdoor','Sports'))  ORDER BY id
---
      def index
        @activities = Activity.all